; ModuleID = '/tmp/.tmpwBVS5I/benchmarks/pipeline_controller.st.ll'
source_filename = "/workspaces/ICSPrism/benchmarks/pipeline_controller.st"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%__vtable_PipelineCtrl = type { ptr }
%PLC_PRG = type { i16, i16, i16, i16, i16, i16, i8, %PipelineCtrl }
%PipelineCtrl = type { ptr, i16, i16, i16, i16, i16, i16, i8, i8, i8, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, [64 x i16], i16, i16 }

@PHASE_IDLE = unnamed_addr constant i8 0, !dbg !0
@PHASE_PRIME = unnamed_addr constant i8 1, !dbg !5
@PHASE_FLOW = unnamed_addr constant i8 2, !dbg !7
@PHASE_FILL = unnamed_addr constant i8 3, !dbg !9
@__vtable_PipelineCtrl_instance = global %__vtable_PipelineCtrl zeroinitializer
@PLC_PRG_instance = global %PLC_PRG zeroinitializer, !dbg !11
@llvm.global_ctors = appending global [1 x { i32, ptr, ptr }] [{ i32, ptr, ptr } { i32 65535, ptr @__unit_pipeline_controller_st__ctor, ptr null }]

define void @PipelineCtrl(ptr %0) !dbg !59 {
entry:
    #dbg_declare(ptr %0, !63, !DIExpression(), !64)
  %this = alloca ptr, align 8
  store ptr %0, ptr %this, align 8
  %__vtable = getelementptr inbounds nuw %PipelineCtrl, ptr %0, i32 0, i32 0
  %PumpRate = getelementptr inbounds nuw %PipelineCtrl, ptr %0, i32 0, i32 1
  %ValvePos = getelementptr inbounds nuw %PipelineCtrl, ptr %0, i32 0, i32 2

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PHASE_IDLE", scope: !2, file: !2, line: 57, type: !3, isLocal: false, isDefinition: true)
!2 = !DIFile(filename: "benchmarks/pipeline_controller.st", directory: "/workspaces/ICSPrism")
!3 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!4 = !DIBasicType(name: "SINT", size: 8, encoding: DW_ATE_signed, flags: DIFlagPublic)
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "PHASE_PRIME", scope: !2, file: !2, line: 58, type: !3, isLocal: false, isDefinition: true)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "PHASE_FLOW", scope: !2, file: !2, line: 59, type: !3, isLocal: false, isDefinition: true)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "PHASE_FILL", scope: !2, file: !2, line: 60, type: !3, isLocal: false, isDefinition: true)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "PLC_PRG", scope: !2, file: !2, line: 63, type: !13, isLocal: false, isDefinition: true)
!13 = !DICompositeType(tag: DW_TAG_structure_type, name: "PLC_PRG", scope: !2, file: !2, line: 63, size: 1536, align: 64, flags: DIFlagPublic, elements: !14, identifier: "PLC_PRG")
!14 = !{!15, !17, !18, !19, !20, !21, !22, !23}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "PumpRate", scope: !2, file: !2, line: 65, baseType: !16, size: 16, align: 16, flags: DIFlagPublic)
!16 = !DIBasicType(name: "INT", size: 16, encoding: DW_ATE_signed, flags: DIFlagPublic)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "ValvePos", scope: !2, file: !2, line: 66, baseType: !16, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "PipeTemp", scope: !2, file: !2, line: 67, baseType: !16, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "BackPressure", scope: !2, file: !2, line: 68, baseType: !16, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "FeedConc", scope: !2, file: !2, line: 69, baseType: !16, size: 16, align: 16, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "CoolantRate", scope: !2, file: !2, line: 70, baseType: !16, size: 16, align: 16, offset: 80, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Cmd", scope: !2, file: !2, line: 71, baseType: !4, size: 8, align: 8, offset: 96, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Ctrl", scope: !2, file: !2, line: 74, baseType: !24, size: 1408, align: 64, offset: 128, flags: DIFlagPublic)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "PipelineCtrl", scope: !2, file: !2, line: 90, size: 1408, align: 64, flags: DIFlagPublic, elements: !25, identifier: "PipelineCtrl")
!25 = !{!26, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !53, !54}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__vtable", scope: !2, file: !2, baseType: !27, size: 64, align: 64, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__POINTER_TO____PipelineCtrl___vtable", scope: !2, file: !2, baseType: !28, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__PipelineCtrl___vtable", baseType: !29, size: 64, align: 64, dwarfAddressSpace: 1)
!29 = !DIBasicType(name: "__VOID", encoding: DW_ATE_unsigned, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "PumpRate", scope: !2, file: !2, line: 92, baseType: !16, size: 16, align: 16, offset: 64, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ValvePos", scope: !2, file: !2, line: 93, baseType: !16, size: 16, align: 16, offset: 80, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "PipeTemp", scope: !2, file: !2, line: 94, baseType: !16, size: 16, align: 16, offset: 96, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "BackPressure", scope: !2, file: !2, line: 95, baseType: !16, size: 16, align: 16, offset: 112, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "FeedConc", scope: !2, file: !2, line: 96, baseType: !16, size: 16, align: 16, offset: 128, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "CoolantRate", scope: !2, file: !2, line: 97, baseType: !16, size: 16, align: 16, offset: 144, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Cmd", scope: !2, file: !2, line: 98, baseType: !4, size: 8, align: 8, offset: 160, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !2, file: !2, line: 101, baseType: !4, size: 8, align: 8, offset: 168, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Phase", scope: !2, file: !2, line: 104, baseType: !4, size: 8, align: 8, offset: 176, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "CycleCount", scope: !2, file: !2, line: 105, baseType: !16, size: 16, align: 16, offset: 192, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "PrimeCycles", scope: !2, file: !2, line: 107, baseType: !16, size: 16, align: 16, offset: 208, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "PrimeScore", scope: !2, file: !2, line: 108, baseType: !16, size: 16, align: 16, offset: 224, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "FluxScore", scope: !2, file: !2, line: 110, baseType: !16, size: 16, align: 16, offset: 240, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "FluxSum", scope: !2, file: !2, line: 111, baseType: !16, size: 16, align: 16, offset: 256, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "FlowAccum", scope: !2, file: !2, line: 113, baseType: !16, size: 16, align: 16, offset: 272, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "PressAccum", scope: !2, file: !2, line: 114, baseType: !16, size: 16, align: 16, offset: 288, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "TempAccum", scope: !2, file: !2, line: 115, baseType: !16, size: 16, align: 16, offset: 304, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "PhaseCounter", scope: !2, file: !2, line: 116, baseType: !16, size: 16, align: 16, offset: 320, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "FillHead", scope: !2, file: !2, line: 118, baseType: !16, size: 16, align: 16, offset: 336, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !2, file: !2, line: 120, baseType: !50, size: 1024, align: 16, offset: 352, flags: DIFlagPublic)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 1024, align: 16, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 64, lowerBound: 0)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "PVsum", scope: !2, file: !2, line: 121, baseType: !16, size: 16, align: 16, offset: 1376, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !2, file: !2, line: 122, baseType: !16, size: 16, align: 16, offset: 1392, flags: DIFlagPublic)
!55 = !{i32 2, !"Dwarf Version", i32 5}
!56 = !{i32 2, !"Debug Info Version", i32 3}
!57 = distinct !DICompileUnit(language: DW_LANG_C, file: !2, producer: "RuSTy Structured text Compiler", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !58, splitDebugInlining: false)
!58 = !{!0, !5, !7, !9, !11}
!59 = distinct !DISubprogram(name: "PipelineCtrl", linkageName: "PipelineCtrl", scope: !2, file: !2, line: 90, type: !60, scopeLine: 125, flags: DIFlagPublic, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !57, retainedNodes: !62)
!60 = !DISubroutineType(flags: DIFlagPublic, types: !61)
!61 = !{null, !24, !16, !16, !16, !16, !16, !16, !4, !4}
!62 = !{}
!63 = !DILocalVariable(name: "PipelineCtrl", scope: !59, file: !2, line: 125, type: !24)
!64 = !DILocation(line: 125, scope: !59)
!65 = !DILocation(line: 127, column: 5, scope: !59)
!66 = !DILocation(line: 130, column: 11, scope: !59)
!67 = !DILocation(line: 150, column: 8, scope: !59)
!68 = !DILocation(line: 151, column: 8, scope: !59)
!69 = !DILocation(line: 153, column: 11, scope: !59)
!70 = !DILocation(line: 172, column: 8, scope: !59)
!71 = !DILocation(line: 174, column: 11, scope: !59)
!72 = !DILocation(line: 193, column: 8, scope: !59)
!73 = !DILocation(line: 198, column: 11, scope: !59)
!74 = !DILocation(line: 341, scope: !59)
!75 = !DILocation(line: 343, scope: !59)
!76 = !DILocation(line: 345, scope: !59)
!77 = !DILocation(line: 131, column: 16, scope: !59)
!78 = !DILocation(line: 0, scope: !59)
!79 = !DILocation(line: 134, column: 12, scope: !59)
!80 = !DILocation(line: 135, column: 12, scope: !59)
!81 = !DILocation(line: 136, column: 12, scope: !59)
!82 = !DILocation(line: 137, column: 12, scope: !59)
!83 = !DILocation(line: 138, column: 12, scope: !59)
!84 = !DILocation(line: 139, column: 12, scope: !59)
!85 = !DILocation(line: 140, column: 12, scope: !59)
!86 = !DILocation(line: 141, column: 12, scope: !59)
!87 = !DILocation(line: 142, column: 12, scope: !59)
!88 = !DILocation(line: 143, column: 12, scope: !59)
!89 = !DILocation(line: 144, column: 8, scope: !59)
!90 = !DILocation(line: 132, column: 16, scope: !59)
!91 = !DILocation(line: 154, column: 15, scope: !59)
!92 = !DILocation(line: 165, column: 11, scope: !59)
!93 = !DILocation(line: 155, column: 16, scope: !59)
!94 = !DILocation(line: 162, column: 12, scope: !59)
!95 = !DILocation(line: 157, column: 19, scope: !59)
!96 = !DILocation(line: 163, column: 8, scope: !59)
!97 = !DILocation(line: 158, column: 20, scope: !59)
!98 = !DILocation(line: 161, column: 16, scope: !59)
!99 = !DILocation(line: 160, column: 20, scope: !59)
!100 = !DILocation(line: 166, column: 12, scope: !59)
!101 = !DILocation(line: 167, column: 8, scope: !59)
!102 = !DILocation(line: 175, column: 12, scope: !59)
!103 = !DILocation(line: 182, column: 8, scope: !59)
!104 = !DILocation(line: 177, column: 15, scope: !59)
!105 = !DILocation(line: 184, column: 11, scope: !59)
!106 = !DILocation(line: 178, column: 16, scope: !59)
!107 = !DILocation(line: 181, column: 12, scope: !59)
!108 = !DILocation(line: 180, column: 16, scope: !59)
!109 = !DILocation(line: 185, column: 12, scope: !59)
!110 = !DILocation(line: 186, column: 8, scope: !59)
!111 = !DILocation(line: 188, column: 11, scope: !59)
!112 = !DILocation(line: 189, column: 12, scope: !59)
!113 = !DILocation(line: 190, column: 8, scope: !59)
!114 = !DILocation(line: 199, column: 12, scope: !59)
!115 = !DILocation(line: 206, column: 8, scope: !59)
!116 = !DILocation(line: 201, column: 15, scope: !59)
!117 = !DILocation(line: 208, column: 11, scope: !59)
!118 = !DILocation(line: 202, column: 16, scope: !59)
!119 = !DILocation(line: 205, column: 12, scope: !59)
!120 = !DILocation(line: 204, column: 16, scope: !59)
!121 = !DILocation(line: 209, column: 12, scope: !59)
!122 = !DILocation(line: 214, column: 8, scope: !59)
