; ModuleID = '/tmp/.tmp3gXbF7/benchmarks/pump_controller.st.ll'
source_filename = "/workspaces/ICSPrism/benchmarks/pump_controller.st"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%__vtable_PumpController = type { ptr }
%PLC_PRG = type { i8, i8, i8, i16, i16, %PumpController }
%PumpController = type { ptr, i8, i8, i8, i16, i16, i8, i16, i16, i16, i16, [8 x i16], i16, i8 }

@MODE_INIT = unnamed_addr constant i8 0, !dbg !0
@MODE_IDLE = unnamed_addr constant i8 1, !dbg !5
@MODE_ARMED = unnamed_addr constant i8 2, !dbg !7
@MODE_RUN = unnamed_addr constant i8 3, !dbg !9
@MODE_FAULT = unnamed_addr constant i8 4, !dbg !11
@__vtable_PumpController_instance = global %__vtable_PumpController zeroinitializer
@PLC_PRG_instance = global %PLC_PRG zeroinitializer, !dbg !13
@llvm.global_ctors = appending global [1 x { i32, ptr, ptr }] [{ i32, ptr, ptr } { i32 65535, ptr @__unit_pump_controller_st__ctor, ptr null }]

define void @PumpController(ptr %0) !dbg !51 {
entry:
    #dbg_declare(ptr %0, !55, !DIExpression(), !56)
  %this = alloca ptr, align 8
  store ptr %0, ptr %this, align 8
  %__vtable = getelementptr inbounds nuw %PumpController, ptr %0, i32 0, i32 0
  %CmdArm = getelementptr inbounds nuw %PumpController, ptr %0, i32 0, i32 1
  %CmdStart = getelementptr inbounds nuw %PumpController, ptr %0, i32 0, i32 2
  %CmdReset = getelementptr inbounds nuw %PumpController, ptr %0, i32 0, i32 3

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "MODE_INIT", scope: !2, file: !2, line: 2, type: !3, isLocal: false, isDefinition: true)
!2 = !DIFile(filename: "benchmarks/pump_controller.st", directory: "/workspaces/ICSPrism")
!3 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!4 = !DIBasicType(name: "SINT", size: 8, encoding: DW_ATE_signed, flags: DIFlagPublic)
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "MODE_IDLE", scope: !2, file: !2, line: 3, type: !3, isLocal: false, isDefinition: true)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(name: "MODE_ARMED", scope: !2, file: !2, line: 4, type: !3, isLocal: false, isDefinition: true)
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "MODE_RUN", scope: !2, file: !2, line: 5, type: !3, isLocal: false, isDefinition: true)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "MODE_FAULT", scope: !2, file: !2, line: 6, type: !3, isLocal: false, isDefinition: true)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "PLC_PRG", scope: !2, file: !2, line: 9, type: !15, isLocal: false, isDefinition: true)
!15 = !DICompositeType(tag: DW_TAG_structure_type, name: "PLC_PRG", scope: !2, file: !2, line: 9, size: 448, align: 64, flags: DIFlagPublic, elements: !16, identifier: "PLC_PRG")
!16 = !{!17, !19, !20, !21, !23, !24}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "CmdArm", scope: !2, file: !2, line: 11, baseType: !18, size: 8, align: 8, flags: DIFlagPublic)
!18 = !DIBasicType(name: "BOOL", size: 8, encoding: DW_ATE_boolean, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "CmdStart", scope: !2, file: !2, line: 12, baseType: !18, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "CmdReset", scope: !2, file: !2, line: 13, baseType: !18, size: 8, align: 8, offset: 16, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !2, file: !2, line: 14, baseType: !22, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!22 = !DIBasicType(name: "INT", size: 16, encoding: DW_ATE_signed, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Temp", scope: !2, file: !2, line: 15, baseType: !22, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "Controller", scope: !2, file: !2, line: 18, baseType: !25, size: 384, align: 64, offset: 64, flags: DIFlagPublic)
!25 = !DICompositeType(tag: DW_TAG_structure_type, name: "PumpController", scope: !2, file: !2, line: 32, size: 384, align: 64, flags: DIFlagPublic, elements: !26, identifier: "PumpController")
!26 = !{!27, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !45, !46}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "__vtable", scope: !2, file: !2, baseType: !28, size: 64, align: 64, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__POINTER_TO____PumpController___vtable", scope: !2, file: !2, baseType: !29, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__PumpController___vtable", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 1)
!30 = !DIBasicType(name: "__VOID", encoding: DW_ATE_unsigned, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "CmdArm", scope: !2, file: !2, line: 34, baseType: !18, size: 8, align: 8, offset: 64, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "CmdStart", scope: !2, file: !2, line: 35, baseType: !18, size: 8, align: 8, offset: 72, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "CmdReset", scope: !2, file: !2, line: 36, baseType: !18, size: 8, align: 8, offset: 80, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !2, file: !2, line: 37, baseType: !22, size: 16, align: 16, offset: 96, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Temp", scope: !2, file: !2, line: 38, baseType: !22, size: 16, align: 16, offset: 112, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Mode", scope: !2, file: !2, line: 41, baseType: !4, size: 8, align: 8, offset: 128, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "CycleCount", scope: !2, file: !2, line: 42, baseType: !22, size: 16, align: 16, offset: 144, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "PressureScore", scope: !2, file: !2, line: 43, baseType: !22, size: 16, align: 16, offset: 160, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ArmedCycles", scope: !2, file: !2, line: 44, baseType: !22, size: 16, align: 16, offset: 176, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !2, file: !2, line: 45, baseType: !22, size: 16, align: 16, offset: 192, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Buffer", scope: !2, file: !2, line: 46, baseType: !42, size: 128, align: 16, offset: 208, flags: DIFlagPublic)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, align: 16, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 8, lowerBound: 0)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !2, file: !2, line: 47, baseType: !22, size: 16, align: 16, offset: 336, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !2, file: !2, line: 50, baseType: !4, size: 8, align: 8, offset: 352, flags: DIFlagPublic)
!47 = !{i32 2, !"Dwarf Version", i32 5}
!48 = !{i32 2, !"Debug Info Version", i32 3}
!49 = distinct !DICompileUnit(language: DW_LANG_C, file: !2, producer: "RuSTy Structured text Compiler", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !50, splitDebugInlining: false)
!50 = !{!0, !5, !7, !9, !11, !13}
!51 = distinct !DISubprogram(name: "PumpController", linkageName: "PumpController", scope: !2, file: !2, line: 32, type: !52, scopeLine: 53, flags: DIFlagPublic, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !49, retainedNodes: !54)
!52 = !DISubroutineType(flags: DIFlagPublic, types: !53)
!53 = !{null, !25, !18, !18, !18, !22, !22, !4}
!54 = !{}
!55 = !DILocalVariable(name: "PumpController", scope: !51, file: !2, line: 53, type: !25)
!56 = !DILocation(line: 53, scope: !51)
!57 = !DILocation(line: 55, column: 5, scope: !51)
!58 = !DILocation(line: 58, column: 12, scope: !51)
!59 = !DILocation(line: 0, scope: !51)
!60 = !DILocation(line: 67, column: 11, scope: !51)
!61 = !DILocation(line: 79, column: 8, scope: !51)
!62 = !DILocation(line: 81, column: 11, scope: !51)
!63 = !DILocation(line: 91, column: 11, scope: !51)
!64 = !DILocation(line: 126, column: 11, scope: !51)
!65 = !DILocation(line: 133, scope: !51)
!66 = !DILocation(line: 135, scope: !51)
!67 = !DILocation(line: 137, scope: !51)
!68 = !DILocation(line: 61, column: 8, scope: !51)
!69 = !DILocation(line: 62, column: 8, scope: !51)
!70 = !DILocation(line: 63, column: 8, scope: !51)
!71 = !DILocation(line: 64, column: 8, scope: !51)
!72 = !DILocation(line: 59, column: 12, scope: !51)
!73 = !DILocation(line: 68, column: 12, scope: !51)
!74 = !DILocation(line: 69, column: 12, scope: !51)
!75 = !DILocation(line: 70, column: 12, scope: !51)
!76 = !DILocation(line: 71, column: 8, scope: !51)
!77 = !DILocation(line: 73, column: 11, scope: !51)
!78 = !DILocation(line: 74, column: 12, scope: !51)
!79 = !DILocation(line: 75, column: 12, scope: !51)
!80 = !DILocation(line: 76, column: 8, scope: !51)
!81 = !DILocation(line: 82, column: 12, scope: !51)
!82 = !DILocation(line: 83, column: 12, scope: !51)
!83 = !DILocation(line: 84, column: 12, scope: !51)
!84 = !DILocation(line: 85, column: 12, scope: !51)
!85 = !DILocation(line: 88, column: 8, scope: !51)
!86 = !DILocation(line: 86, column: 14, scope: !51)
!87 = !DILocation(line: 87, column: 12, scope: !51)
!88 = !DILocation(line: 92, column: 12, scope: !51)
!89 = !DILocation(line: 93, column: 8, scope: !51)
!90 = !DILocation(line: 95, column: 11, scope: !51)
!91 = !DILocation(line: 96, column: 12, scope: !51)
!92 = !DILocation(line: 97, column: 8, scope: !51)
!93 = !DILocation(line: 99, column: 11, scope: !51)
!94 = !DILocation(line: 100, column: 12, scope: !51)
!95 = !DILocation(line: 101, column: 8, scope: !51)
!96 = !DILocation(line: 103, column: 11, scope: !51)
!97 = !DILocation(line: 104, column: 12, scope: !51)
!98 = !DILocation(line: 105, column: 8, scope: !51)
!99 = !DILocation(line: 110, column: 11, scope: !51)
!100 = !DILocation(line: 111, column: 12, scope: !51)
!101 = !DILocation(line: 112, column: 8, scope: !51)
!102 = !DILocation(line: 114, column: 11, scope: !51)
!103 = !DILocation(line: 115, column: 12, scope: !51)
!104 = !DILocation(line: 116, column: 12, scope: !51)
!105 = !DILocation(line: 117, column: 12, scope: !51)
!106 = !DILocation(line: 118, column: 12, scope: !51)
!107 = !DILocation(line: 119, column: 8, scope: !51)
!108 = !DILocation(line: 121, column: 11, scope: !51)
!109 = !DILocation(line: 122, column: 12, scope: !51)
!110 = !DILocation(line: 123, column: 8, scope: !51)
!111 = !DILocation(line: 127, column: 12, scope: !51)
!112 = !DILocation(line: 128, column: 12, scope: !51)
!113 = !DILocation(line: 129, column: 12, scope: !51)
!114 = !DILocation(line: 130, column: 12, scope: !51)
!115 = !DILocation(line: 131, column: 8, scope: !51)
